dreamted/TRIO_MR_MD/1. TRIO-M/TRIO_M_appl_src_20141204_V5_5_20151207/lib_stm32/src/stm32f10x_tim1_v0901.c
/* Alias word address of CC3NE bit */
#define CC3NE_BitNumber   0x0A
#define CCER_CC3NE_BB     (PERIPH_BB_BASE + (CCER_OFFSET * 32) + (CC3NE_BitNumber * 4))

/* Alias word address of CC3NP bit */
#define CC3NP_BitNumber   0x0B
#define CCER_CC3NP_BB     (PERIPH_BB_BASE + (CCER_OFFSET * 32) + (CC3NP_BitNumber * 4))

/* Alias word address of CC4E bit */
#define CC4E_BitNumber    0x0C
#define CCER_CC4E_BB      (PERIPH_BB_BASE + (CCER_OFFSET * 32) + (CC4E_BitNumber * 4))

/* Alias word address of CC4P bit */
#define CC4P_BitNumber    0x0D
#define CCER_CC4P_BB      (PERIPH_BB_BASE + (CCER_OFFSET * 32) + (CC4P_BitNumber * 4))

/* --- TIM1 BDTR Register --- */
/* Alias word address of MOE bit */
#define BDTR_OFFSET       (TIM1_OFFSET + 0x44)
#define MOE_BitNumber     0x0F
#define BDTR_MOE_BB       (PERIPH_BB_BASE + (BDTR_OFFSET * 32) + (MOE_BitNumber * 4))

/* --- TIM1 CCMR1 Register --- */
/* Alias word address of OC1FE bit */
#define CCMR1_OFFSET      (TIM1_OFFSET + 0x18)
#define OC1FE_BitNumber   0x02
#define CCMR1_OC1FE_BB    (PERIPH_BB_BASE + (CCMR1_OFFSET * 32) + (OC1FE_BitNumber * 4))

/* Alias word address of OC1PE bit */
#define OC1PE_BitNumber   0x03
#define CCMR1_OC1PE_BB    (PERIPH_BB_BASE + (CCMR1_OFFSET * 32) + (OC1PE_BitNumber * 4))

/* Alias word address of OC1CE bit */
#define OC1CE_BitNumber   0x07
#define CCMR1_OC1CE_BB    (PERIPH_BB_BASE + (CCMR1_OFFSET * 32) + (OC1CE_BitNumber * 4))

/* Alias word address of OC2FE bit */
#define OC2FE_BitNumber   0x0A
#define CCMR1_OC2FE_BB    (PERIPH_BB_BASE + (CCMR1_OFFSET * 32) + (OC2FE_BitNumber * 4))

/* Alias word address of OC2PE bit */
#define OC2PE_BitNumber   0x0B
#define CCMR1_OC2PE_BB    (PERIPH_BB_BASE + (CCMR1_OFFSET * 32) + (OC2PE_BitNumber * 4))

/* Alias word address of OC2CE bit */
#define OC2CE_BitNumber   0x0F
#define CCMR1_OC2CE_BB    (PERIPH_BB_BASE + (CCMR1_OFFSET * 32) + (OC2CE_BitNumber * 4))

/* --- TIM1 CCMR2 Register ---- */
/* Alias word address of OC3FE bit */
#define CCMR2_OFFSET      (TIM1_OFFSET + 0x1C)
#define OC3FE_BitNumber   0x02
#define CCMR2_OC3FE_BB    (PERIPH_BB_BASE + (CCMR2_OFFSET * 32) + (OC3FE_BitNumber * 4))

/* Alias word address of OC3PE bit */
#define OC3PE_BitNumber   0x03
#define CCMR2_OC3PE_BB    (PERIPH_BB_BASE + (CCMR2_OFFSET * 32) + (OC3PE_BitNumber * 4))

/* Alias word address of OC3CE bit */
#define OC3CE_BitNumber   0x07
#define CCMR2_OC3CE_BB    (PERIPH_BB_BASE + (CCMR2_OFFSET * 32) + (OC3CE_BitNumber * 4))

/* Alias word address of OC4FE bit */
#define OC4FE_BitNumber   0x0A
#define CCMR2_OC4FE_BB    (PERIPH_BB_BASE + (CCMR2_OFFSET * 32) + (OC4FE_BitNumber * 4))

/* Alias word address of OC4PE bit */
#define OC4PE_BitNumber   0x0B
#define CCMR2_OC4PE_BB    (PERIPH_BB_BASE + (CCMR2_OFFSET * 32) + (OC4PE_BitNumber * 4))

/* Alias word address of OC4CE bit */
#define OC4CE_BitNumber   0x0F
#define CCMR2_OC4CE_BB    (PERIPH_BB_BASE + (CCMR2_OFFSET * 32) + (OC4CE_BitNumber * 4))

/* --------------------- TIM1 registers bit mask ------------------------- */
/* TIM1 CR1 Mask */
#define CR1_CounterMode_Mask                ((u16)0x039F)
#define CR1_CKD_Mask                        ((u16)0x00FF)

/* TIM1 CR2 Mask */
#define CR2_MMS_Mask                        ((u16)0x0080)

/* TIM1 SMCR Mask */
#define SMCR_SMS_Mask                       ((u16)0xFFF0)
#define SMCR_ETR_Mask                       ((u16)0x40F7)
#define SMCR_TS_Mask                        ((u16)0xFF87)
#define SMCR_ECE_Set                        ((u16)0x0001)

/* TIM1 CCMRx Mask */
#define CCMR_CC13S_Mask                     ((u16)0xFFFC)
#define CCMR_CC24S_Mask                     ((u16)0xFCFF)
#define CCMR_TI13Direct_Set                 ((u16)0x0001)
#define CCMR_TI24Direct_Set                 ((u16)0x0100)
#define CCMR_OCM13_Mask                     ((u16)0x7F0F)
#define CCMR_OCM24_Mask                     ((u16)0x0F7F)
#define CCMR_IC13PSC_Mask                   ((u16)0xFFF3)
#define CCMR_IC24PSC_Mask                   ((u16)0xF3FF)
#define CCMR_IC13F_Mask                     ((u16)0xFF0F)
#define CCMR_IC24F_Mask                     ((u16)0x0FFF)
#define OC13Mode_Mask		                ((u16)0xFF00)
#define OC24Mode_Mask		                ((u16)0x00FF)

/* TIM1 CCER Set/Reset Bit */
#define CCER_CCE_Set                        ((u16)0x0001)
#define CCER_CCE_Reset                      ((u16)0x0000)

/* TIM1 DMA Mask */
#define DCR_DMA_Mask                        ((u16)0x0000)

/* TIM1 private Masks */
#define TIM1_Period_Reset_Mask               ((u16)0xFFFF)
#define TIM1_Prescaler_Reset_Mask            ((u16)0x0000)
#define TIM1_RepetitionCounter_Reset_Mask    ((u16)0x0000)
#define TIM1_Pulse_Reset_Mask                ((u16)0x0000)
#define TIM1_ICFilter_Mask                   ((u8)0x00)
#define TIM1_DeadTime_Reset_Mask             ((u16)0x0000)

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
static void TI1_Config(u16 TIM1_ICPolarity, u16 TIM1_ICSelection,
                       u8 TIM1_ICFilter);
static void TI2_Config(u16 TIM1_ICPolarity, u16 TIM1_ICSelection,
                       u8 TIM1_ICFilter);
static void TI3_Config(u16 TIM1_ICPolarity, u16 TIM1_ICSelection,
                       u8 TIM1_ICFilter);
static void TI4_Config(u16 TIM1_ICPolarity, u16 TIM1_ICSelection,
                       u8 TIM1_ICFilter);

void TIM1_Init(int freq)
{
	int period = (SYSCLK/freq - 1);

	if(period & 0xFFFF0000) period = 0xFFFF;
	TIM1->ARR = period;
	TIM1->PSC = 0;		// default: 0
	TIM1->RCR = 0;		// default: 0
						// default: clock divistion = 0, up counter
	// TIM1 counter enable
	// set or Reset the CEN Bit
	TIM1->CR1.Bit.CEN = ENABLE;
	TIM1->BDTR.Bit.MOE = SET;		// main output enable

	// TIM1 Main Output Enable
	//TIM1_CtrlPWMOutputs(ENABLE);
	//TIM1_CtrlPWMOutputs(DISABLE);
}

void TIM1_OC1Init(int mode, int duty)
{
  /* Check the parameters */
//  assert(IS_TIM1_OC_MODE(TIM1_OCInitStruct->TIM1_OCMode));
//  assert(IS_TIM1_OUTPUT_STATE(TIM1_OCInitStruct->TIM1_OutputState));
//  assert(IS_TIM1_OUTPUTN_STATE(TIM1_OCInitStruct->TIM1_OutputNState));
//  assert(IS_TIM1_OC_POLARITY(TIM1_OCInitStruct->TIM1_OCPolarity));
//  assert(IS_TIM1_OCN_POLARITY(TIM1_OCInitStruct->TIM1_OCNPolarity));
//  assert(IS_TIM1_OCIDLE_STATE(TIM1_OCInitStruct->TIM1_OCIdleState));
//  assert(IS_TIM1_OCNIDLE_STATE(TIM1_OCInitStruct->TIM1_OCNIdleState)); 

  /* Channel 1, 2,3 and 4 Configuration in PWM mode */
//  TIM1_OCInitStructure.TIM1_OCMode = TIM1_OCMode_PWM2; 
//  TIM1_OCInitStructure.TIM1_OutputState = TIM1_OutputState_Enable; 
//  TIM1_OCInitStructure.TIM1_OutputNState = TIM1_OutputNState_Enable;                  
//  TIM1_OCInitStructure.TIM1_Pulse = CCR1_Val; 
//  TIM1_OCInitStructure.TIM1_OCPolarity = TIM1_OCPolarity_Low; 
//  TIM1_OCInitStructure.TIM1_OCNPolarity = TIM1_OCNPolarity_High;         
//  TIM1_OCInitStructure.TIM1_OCIdleState = TIM1_OCIdleState_Set;
//  TIM1_OCInitStructure.TIM1_OCNIdleState = TIM1_OCIdleState_Reset;   

  	// Disable the Channel 1: Reset the CCE Bit
	//  *(vu32 *) CCER_CC1E_BB = CCER_CCE_Reset;
  	TIM1->BDTR.Bit.MOE = RESET; 	  // main output enable
	TIM1->CCER.Bit.CC1E = DISABLE;

	// Reset the Output Compare Bits
	// tmpccmr &= OC13Mode_Mask;

	// Set the Ouput Compare Mode
	// tmpccmr |= TIM1_OCInitStruct->TIM1_OCMode;
	TIM1->CCMR.Bit_OC.OC1M = mode;
	// Set the Output State
	TIM1->CCER.Bit.CC1E = ENABLE;

	// Set the Output N State
	//  *(vu32 *) CCER_CC1NE_BB = TIM1_OCInitStruct->TIM1_OutputNState;

	// Set the Output Polarity
	//  *(vu32 *) CCER_CC1P_BB = TIM1_OCInitStruct->TIM1_OCPolarity;

	// Set the Output N Polarity
	// *(vu32 *) CCER_CC1NP_BB = TIM1_OCInitStruct->TIM1_OCNPolarity;

	// Set the Output Idle state
	TIM1->CR2.Bit.OIS1 = SET;
	//  *(vu32 *) CR2_OIS1_BB = TIM1_OCInitStruct->TIM1_OCIdleState;

	// Set the Output N Idle state
	TIM1->CR2.Bit.OIS1N = RESET;
	//  *(vu32 *) CR2_OIS1N_BB = TIM1_OCInitStruct->TIM1_OCNIdleState;

