dreamted/TRIO_MR_MD/1. TRIO-M/TRIO_M_appl_src_20141204_V5_5_20151207/lib_stm32/src/stm32f10x_tim1_v0901.c
	// Set the Pulse value
	if(mode == __TIM1_PWM2) TIM1->CCR1 =  ((TIM1->ARR)*duty)/100;
  	TIM1->BDTR.Bit.MOE = SET; 	  // main output enable

}

void TIM1_OC1PWMOutputs(int tEn)
{
	TIM1->CCER.Bit.CC1E = tEn;
}

void TIM1_OC4PWMOutputs(int tEn)
{
	TIM1->CCER.Bit.CC4E = tEn;
}

/*******************************************************************************
* Function Name  : TIM1_OC4Init
* Description    : Initializes the TIM1 Channel4 according to the specified
*                  parameters in the TIM1_OCInitStruct.
* Input          : - TIM1_OCInitStruct: pointer to a TIM1_OCInitTypeDef structure that
*                    contains the configuration information for the TIM1 peripheral.
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_OC4Init(int mode, int duty)
{
    //u32 tmpccmr = 0;
  
    /* Check the parameters */
    //assert(IS_TIM1_OC_MODE(TIM1_OCInitStruct->TIM1_OCMode));
    //assert(IS_TIM1_OUTPUT_STATE(TIM1_OCInitStruct->TIM1_OutputState));
    //assert(IS_TIM1_OC_POLARITY(TIM1_OCInitStruct->TIM1_OCPolarity));
    //assert(IS_TIM1_OCIDLE_STATE(TIM1_OCInitStruct->TIM1_OCIdleState));
  
    //tmpccmr = TIM1->CCMR2.Data;
  
    // Disable the Channel 4: Reset the CCE Bit
    //*(vu32 *) CCER_CC4E_BB = CCER_CCE_Reset;
    TIM1->BDTR.Bit.MOE = RESET;		// main output enable
    TIM1->CCER.Bit.CC4E = DISABLE;
  
    // Reset the Output Compare Bits
    // tmpccmr &= OC24Mode_Mask;
  
    /* Set the Ouput Compare Mode */
    //tmpccmr |= (u32)TIM1_OCInitStruct->TIM1_OCMode << 8;
    //TIM1->CCMR2.Data = (u16)tmpccmr;
    TIM1->CCMR.Bit_OC.OC4M = mode;
    TIM1->CCER.Bit.CC4E = ENABLE;
  
    /* Set the Output State */
    //*(vu32 *) CCER_CC4E_BB = TIM1_OCInitStruct->TIM1_OutputState;
  
    /* Set the Output Polarity */
   // *(vu32 *) CCER_CC4P_BB = TIM1_OCInitStruct->TIM1_OCPolarity;
  
    /* Set the Output Idle state */
    //*(vu32 *) CR2_OIS4_BB = TIM1_OCInitStruct->TIM1_OCIdleState;
	TIM1->CR2.Bit.OIS1 = SET;
	
    /* Set the Pulse value */
    // Set the Pulse value
    if(mode == __TIM1_PWM2) TIM1->CCR4 =	((TIM1->ARR)*duty)/100;
    TIM1->BDTR.Bit.MOE = SET;		// main output enable
}


/*******************************************************************************
* Function Name  : TIM1_TimeBaseInit
* Description    : Initializes the TIM1 Time Base Unit according to the specified
*                  parameters in the TIM1_TimeBaseInitStruct.
* Input          : - TIM1_TimeBaseInitStruct: pointer to a TIM1_TimeBaseInitTypeDef
*                    structure that contains the configuration information for
*                    the specified TIM1 peripheral.
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_TimeBaseInit(TIM1_TimeBaseInitTypeDef* TIM1_TimeBaseInitStruct)
{
 /* Check the parameters */
  assert(IS_TIM1_COUNTER_MODE(TIM1_TimeBaseInitStruct->TIM1_CounterMode));

  /* Set the Autoreload value */
  TIM1->ARR = TIM1_TimeBaseInitStruct->TIM1_Period ;

  /* Set the Prescaler value */
  TIM1->PSC = TIM1_TimeBaseInitStruct->TIM1_Prescaler;

  /* Select the Counter Mode and set the clock division */
  TIM1->CR1.Data &= CR1_CKD_Mask & CR1_CounterMode_Mask;
  TIM1->CR1.Data |= (u32)TIM1_TimeBaseInitStruct->TIM1_ClockDivision |
               TIM1_TimeBaseInitStruct->TIM1_CounterMode;

  /* Set the Repetition Counter value */
  TIM1->RCR = TIM1_TimeBaseInitStruct->TIM1_RepetitionCounter;
}

/*******************************************************************************
* Function Name  : TIM1_OC1Init
* Description    : Initializes the TIM1 Channel1 according to the specified
*                  parameters in the TIM1_OCInitStruct.
* Input          : - TIM1_OCInitStruct: pointer to a TIM1_OCInitTypeDef structure that
*                    contains the configuration information for the TIM1 peripheral.
* Output         : None
* Return         : None
*******************************************************************************/
extern unsigned long int USART1Printf( const char *format, ...);

/*******************************************************************************
* Function Name  : TIM1_OC2Init
* Description    : Initializes the TIM1 Channel2 according to the specified
*                  parameters in the TIM1_OCInitStruct.
* Input          : - TIM1_OCInitStruct: pointer to a TIM1_OCInitTypeDef structure that
*                    contains the configuration information for the TIM1 peripheral.
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_OC2Init(TIM1_OCInitTypeDef* TIM1_OCInitStruct)
{
  u32 tmpccmr = 0;

  /* Check the parameters */
  assert(IS_TIM1_OC_MODE(TIM1_OCInitStruct->TIM1_OCMode));
  assert(IS_TIM1_OUTPUT_STATE(TIM1_OCInitStruct->TIM1_OutputState));
  assert(IS_TIM1_OUTPUTN_STATE(TIM1_OCInitStruct->TIM1_OutputNState));
  assert(IS_TIM1_OC_POLARITY(TIM1_OCInitStruct->TIM1_OCPolarity));
  assert(IS_TIM1_OCN_POLARITY(TIM1_OCInitStruct->TIM1_OCNPolarity));
  assert(IS_TIM1_OCIDLE_STATE(TIM1_OCInitStruct->TIM1_OCIdleState));
  assert(IS_TIM1_OCNIDLE_STATE(TIM1_OCInitStruct->TIM1_OCNIdleState));

  tmpccmr = TIM1->CCMR.Data[0];

  /* Disable the Channel 2: Reset the CCE Bit */
  *(vu32 *) CCER_CC2E_BB = CCER_CCE_Reset;

  /* Reset the Output Compare Bits */
   tmpccmr &= OC24Mode_Mask;

  /* Set the Ouput Compare Mode */
  tmpccmr |= (u32)TIM1_OCInitStruct->TIM1_OCMode << 8;

  TIM1->CCMR.Data[0] = (u16)tmpccmr;

  /* Set the Output State */
  *(vu32 *) CCER_CC2E_BB = TIM1_OCInitStruct->TIM1_OutputState;

  /* Set the Output N State */
  *(vu32 *) CCER_CC2NE_BB = TIM1_OCInitStruct->TIM1_OutputNState;

  /* Set the Output Polarity */
  *(vu32 *) CCER_CC2P_BB = TIM1_OCInitStruct->TIM1_OCPolarity;

  /* Set the Output N Polarity */
  *(vu32 *) CCER_CC2NP_BB = TIM1_OCInitStruct->TIM1_OCNPolarity;

  /* Set the Output Idle state */
  *(vu32 *) CR2_OIS2_BB = TIM1_OCInitStruct->TIM1_OCIdleState;

  /* Set the Output N Idle state */
  *(vu32 *) CR2_OIS2N_BB = TIM1_OCInitStruct->TIM1_OCNIdleState;

  /* Set the Pulse value */
  TIM1->CCR2 = TIM1_OCInitStruct->TIM1_Pulse;
}

