dreamted/TRIO_MR_MD/1. TRIO-M/TRIO_M_appl_src_20141204_V5_5_20151207/lib_stm32/src/stm32f10x_tim1_v0901.c
  /* Set or Reset the CCDS Bit */
  *(vu32 *) CR2_CCDS_BB = (u16)Newstate;
}

/*******************************************************************************
* Function Name  : TIM1_CCPreloadControl
* Description    : Sets or Resets the TIM1 peripheral Capture Compare Preload 
*                  Control bit.
* Input          : - Newstate: new state of the Capture Compare Preload Control bit
*                    This parameter can be: ENABLE or DISABLE.
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_CCPreloadControl(u32 Newstate)
{
    /* Check the parameters */
    assert(IS_FUNCTIONAL_STATE(Newstate));
  
    /* Set or Reset the CCPC Bit */
    *(vu32 *) CR2_CCPC_BB = (u16)Newstate;
}

/*******************************************************************************
* Function Name  : TIM1_OC1PreloadConfig
* Description    : Enables or disables the TIM1 peripheral Preload Register on CCR1.
* Input          : - TIM1_OCPreload: new state of the Capture Compare Preload
*                    register.
*                    This parameter can be one of the following values:
*                       - TIM1_OCPreload_Enable
*                       - TIM1_OCPreload_Disable
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_OC1PreloadConfig(u16 TIM1_OCPreload)
{
  /* Check the parameters */
  assert(IS_TIM1_OCPRELOAD_STATE(TIM1_OCPreload));

  /* Set or Reset the OC1PE Bit */
  *(vu32 *) CCMR1_OC1PE_BB = (u16)TIM1_OCPreload;
}

/*******************************************************************************
* Function Name  : TIM1_OC2PreloadConfig
* Description    : Enables or disables the TIM1 peripheral Preload Register on CCR2.
* Input          : - TIM1_OCPreload: new state of the Capture Compare Preload
*                    register.
*                    This parameter can be one of the following values:
*                       - TIM1_OCPreload_Enable
*                       - TIM1_OCPreload_Disable
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_OC2PreloadConfig(u16 TIM1_OCPreload)
{
  /* Check the parameters */
  assert(IS_TIM1_OCPRELOAD_STATE(TIM1_OCPreload));

  /* Set or Reset the OC2PE Bit */
  *(vu32 *) CCMR1_OC2PE_BB = (u16)TIM1_OCPreload;
}

/*******************************************************************************
* Function Name  : TIM1_OC3PreloadConfig
* Description    : Enables or disables the TIM1 peripheral Preload Register on CCR3.
* Input          : - TIM1_OCPreload: new state of the Capture Compare Preload
*                    register.
*                    This parameter can be one of the following values:
*                       - TIM1_OCPreload_Enable
*                       - TIM1_OCPreload_Disable
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_OC3PreloadConfig(u16 TIM1_OCPreload)
{
  /* Check the parameters */
  assert(IS_TIM1_OCPRELOAD_STATE(TIM1_OCPreload));

  /* Set or Reset the OC3PE Bit */
  *(vu32 *) CCMR2_OC3PE_BB = (u16)TIM1_OCPreload;
}

/*******************************************************************************
* Function Name  : TIM1_OC4PreloadConfig
* Description    : Enables or disables the TIM1 peripheral Preload Register on CCR4.
* Input          : - TIM1_OCPreload: new state of the Capture Compare Preload
*                    register.
*                    This parameter can be one of the following values:
*                       - TIM1_OCPreload_Enable
*                       - TIM1_OCPreload_Disable
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_OC4PreloadConfig(u16 TIM1_OCPreload)
{
  /* Check the parameters */
  assert(IS_TIM1_OCPRELOAD_STATE(TIM1_OCPreload));

  /* Set or Reset the OC4PE Bit */
  *(vu32 *) CCMR2_OC4PE_BB = (u16)TIM1_OCPreload;
}

/*******************************************************************************
* Function Name  : TIM1_OC1FastConfig
* Description    : Configures the TIM1 Capture Compare 1 Fast feature.
* Input          : - TIM1_OCFast: new state of the Output Compare Fast Enable bit.
*                    This parameter can be one of the following values:
*                       - TIM1_OCFast_Enable
*                       - TIM1_OCFast_Disable
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_OC1FastConfig(u16 TIM1_OCFast)
{
  /* Check the parameters */
  assert(IS_TIM1_OCFAST_STATE(TIM1_OCFast));

  /* Set or Reset the OC1FE Bit */
  *(vu32 *) CCMR1_OC1FE_BB = (u16)TIM1_OCFast;
}

/*******************************************************************************
* Function Name  : TIM1_OC2FastConfig
* Description    : Configures the TIM1 Capture Compare Fast feature.
* Input          : - TIM1_OCFast: new state of the Output Compare Fast Enable bit.
*                    This parameter can be one of the following values:
*                       - TIM1_OCFast_Enable
*                       - TIM1_OCFast_Disable
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_OC2FastConfig(u16 TIM1_OCFast)
{
  /* Check the parameters */
  assert(IS_TIM1_OCFAST_STATE(TIM1_OCFast));

  /* Set or Reset the OC2FE Bit */
  *(vu32 *) CCMR1_OC2FE_BB = (u16)TIM1_OCFast;
}

/*******************************************************************************
* Function Name  : TIM1_OC3FastConfig
* Description    : Configures the TIM1 Capture Compare Fast feature.
* Input          : - TIM1_OCFast: new state of the Output Compare Fast Enable bit.
*                    This parameter can be one of the following values:
*                       - TIM1_OCFast_Enable
*                       - TIM1_OCFast_Disable
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_OC3FastConfig(u16 TIM1_OCFast)
{
  /* Check the parameters */
  assert(IS_TIM1_OCFAST_STATE(TIM1_OCFast));

  /* Set or Reset the OC3FE Bit */
  *(vu32 *) CCMR2_OC3FE_BB = (u16)TIM1_OCFast;
}

