dreamted/TRIO_MR_MD/1. TRIO-M/TRIO_M_appl_src_20141204_V5_5_20151207/lib_stm32/src/stm32f10x_tim1_v0901.c
/*******************************************************************************
* Function Name  : TIM1_OC4FastConfig
* Description    : Configures the TIM1 Capture Compare Fast feature.
* Input          : - TIM1_OCFast: new state of the Output Compare Fast Enable bit.
*                    This parameter can be one of the following values:
*                       - TIM1_OCFast_Enable
*                       - TIM1_OCFast_Disable
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_OC4FastConfig(u16 TIM1_OCFast)
{
  /* Check the parameters */
  assert(IS_TIM1_OCFAST_STATE(TIM1_OCFast));

  /* Set or Reset the OC4FE Bit */
  *(vu32 *) CCMR2_OC4FE_BB = (u16)TIM1_OCFast;
}

/*******************************************************************************
* Function Name  : TIM1_ClearOC1Ref
* Description    : Clears or safeguards the OCREF1 signal on an external event
*                  - TIM1_OCClear: new state of the Output Compare Clear Enable Bit.
*                    This parameter can be one of the following values:
*                       - TIM1_OCClear_Enable
*                       - TIM1_OCClear_Disable
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_ClearOC1Ref(u16 TIM1_OCClear)
{
  /* Check the parameters */
  assert(IS_TIM1_OCCLEAR_STATE(TIM1_OCClear));

  /* Set or Reset the OC1CE Bit */
  *(vu32 *) CCMR1_OC1CE_BB = (u16)TIM1_OCClear;
}

/*******************************************************************************
* Function Name  : TIM1_ClearOC2Ref
* Description    : Clears or safeguards the OCREF2 signal on an external event
*                  - TIM1_OCClear: new state of the Output Compare Clear Enable Bit.
*                    This parameter can be one of the following values:
*                       - TIM1_OCClear_Enable
*                       - TIM1_OCClear_Disable
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_ClearOC2Ref(u16 TIM1_OCClear)
{
  /* Check the parameters */
  assert(IS_TIM1_OCCLEAR_STATE(TIM1_OCClear));

  /* Set or Reset the OC2CE Bit */
  *(vu32 *) CCMR1_OC2CE_BB = (u16)TIM1_OCClear;
}

/*******************************************************************************
* Function Name  : TIM1_ClearOC3Ref
* Description    : Clears or safeguards the OCREF3 signal on an external event
*                  - TIM1_OCClear: new state of the Output Compare Clear Enable Bit.
*                    This parameter can be one of the following values:
*                       - TIM1_OCClear_Enable
*                       - TIM1_OCClear_Disable
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_ClearOC3Ref(u16 TIM1_OCClear)
{
  /* Check the parameters */
  assert(IS_TIM1_OCCLEAR_STATE(TIM1_OCClear));

  /* Set or Reset the OC3CE Bit */
  *(vu32 *) CCMR2_OC3CE_BB = (u16)TIM1_OCClear;
}

/*******************************************************************************
* Function Name  : TIM1_ClearOC4Ref
* Description    : Clears or safeguards the OCREF4 signal on an external event
*                  - TIM1_OCClear: new state of the Output Compare Clear Enable Bit.
*                    This parameter can be one of the following values:
*                       - TIM1_OCClear_Enable
*                       - TIM1_OCClear_Disable
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_ClearOC4Ref(u16 TIM1_OCClear)
{
  /* Check the parameters */
  assert(IS_TIM1_OCCLEAR_STATE(TIM1_OCClear));

  /* Set or Reset the OC4CE Bit */
  *(vu32 *) CCMR2_OC4CE_BB = (u16)TIM1_OCClear;
}

/*******************************************************************************
* Function Name  : TIM1_GenerateEvent
* Description    : Configures the TIM1 event to be generate by software.
* Input          : - TIM1_EventSource: specifies the event source.
*                    This parameter can be one or more of the following values:
*                       - TIM1_EventSource_Update: TIM1 update Event source
*                       - TIM1_EventSource_CC1: TIM1 Capture Compare 1 Event source
*                       - TIM1_EventSource_CC2: TIM1 Capture Compare 2 Event source
*                       - TIM1_EventSource_CC3: TIM1 Capture Compare 3 Event source
*                       - TIM1_EventSource_CC4: TIM1 Capture Compare 4 Event source
*                       - TIM1_EventSource_COM: TIM1 COM Event source
*                       - TIM1_EventSource_Trigger: TIM1 Trigger Event source
*                       - TIM1_EventSourceBreak: TIM1 Break Event source
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_GenerateEvent(u16 TIM1_EventSource)
{
  /* Check the parameters */
  assert(IS_TIM1_EVENT_SOURCE(TIM1_EventSource));

  /* Set the event sources */
  TIM1->EGR.Data |= TIM1_EventSource;
}

/*******************************************************************************
* Function Name  : TIM1_OC1PolarityConfig
* Description    : Configures the TIM1 Channel 1 polarity.
* Input          : - TIM1_OCPolarity: specifies the OC1 Polarity
*                    This parmeter can be one of the following values:
*                       - TIM1_OCPolarity_High: Output Compare active high
*                       - TIM1_OCPolarity_Low: Output Compare active low
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_OC1PolarityConfig(u16 TIM1_OCPolarity)
{
  /* Check the parameters */
  assert(IS_TIM1_OC_POLARITY(TIM1_OCPolarity));

  /* Set or Reset the CC1P Bit */
  *(vu32 *) CCER_CC1P_BB = (u16)TIM1_OCPolarity;
}

/*******************************************************************************
* Function Name  : TIM1_OC1NPolarityConfig
* Description    : Configures the TIM1 Channel 1N polarity.
* Input          : - TIM1_OCPolarity: specifies the OC1N Polarity
*                    This parmeter can be one of the following values:
*                       - TIM1_OCPolarity_High: Output Compare active high
*                       - TIM1_OCPolarity_Low: Output Compare active low
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_OC1NPolarityConfig(u16 TIM1_OCPolarity)
{
  /* Check the parameters */
  assert(IS_TIM1_OC_POLARITY(TIM1_OCPolarity));

  /* Set or Reset the CC3P Bit */
  *(vu32 *) CCER_CC1NP_BB = (u16)TIM1_OCPolarity;
}

