dreamted/TRIO_MR_MD/1. TRIO-M/TRIO_M_appl_src_20141204_V5_5_20151207/lib_stm32/src/stm32f10x_tim1_v0901.c
/*******************************************************************************
* Function Name  : TIM1_OC2PolarityConfig
* Description    : Configures the TIM1 Channel 2 polarity.
* Input          : - TIM1_OCPolarity: specifies the OC2 Polarity
*                    This parmeter can be one of the following values:
*                       - TIM1_OCPolarity_High: Output Compare active high
*                       - TIM1_OCPolarity_Low: Output Compare active low
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_OC2PolarityConfig(u16 TIM1_OCPolarity)
{
  /* Check the parameters */
  assert(IS_TIM1_OC_POLARITY(TIM1_OCPolarity));

  /* Set or Reset the CC2P Bit */
  *(vu32 *) CCER_CC2P_BB = (u16)TIM1_OCPolarity;
}

/*******************************************************************************
* Function Name  : TIM1_OC2NPolarityConfig
* Description    : Configures the TIM1 Channel 2N polarity.
* Input          : - TIM1_OCPolarity: specifies the OC2N Polarity
*                    This parmeter can be one of the following values:
*                       - TIM1_OCPolarity_High: Output Compare active high
*                       - TIM1_OCPolarity_Low: Output Compare active low
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_OC2NPolarityConfig(u16 TIM1_OCPolarity)
{
  /* Check the parameters */
  assert(IS_TIM1_OC_POLARITY(TIM1_OCPolarity));

  /* Set or Reset the CC3P Bit */
  *(vu32 *) CCER_CC2NP_BB = (u16)TIM1_OCPolarity;
}

/*******************************************************************************
* Function Name  : TIM1_OC3PolarityConfig
* Description    : Configures the TIM1 Channel 3 polarity.
* Input          : - TIM1_OCPolarity: specifies the OC3 Polarity
*                    This parmeter can be one of the following values:
*                       - TIM1_OCPolarity_High: Output Compare active high
*                       - TIM1_OCPolarity_Low: Output Compare active low
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_OC3PolarityConfig(u16 TIM1_OCPolarity)
{
  /* Check the parameters */
  assert(IS_TIM1_OC_POLARITY(TIM1_OCPolarity));

  /* Set or Reset the CC3P Bit */
  *(vu32 *) CCER_CC3P_BB = (u16)TIM1_OCPolarity;
}

/*******************************************************************************
* Function Name  : TIM1_OC3NPolarityConfig
* Description    : Configures the TIM1 Channel 3N polarity.
* Input          : - TIM1_OCPolarity: specifies the OC3N Polarity
*                    This parmeter can be one of the following values:
*                       - TIM1_OCPolarity_High: Output Compare active high
*                       - TIM1_OCPolarity_Low: Output Compare active low
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_OC3NPolarityConfig(u16 TIM1_OCPolarity)
{
  /* Check the parameters */
  assert(IS_TIM1_OC_POLARITY(TIM1_OCPolarity));

  /* Set or Reset the CC3P Bit */
  *(vu32 *) CCER_CC3NP_BB = (u16)TIM1_OCPolarity;
}

/*******************************************************************************
* Function Name  : TIM1_OC4PolarityConfig
* Description    : Configures the TIM1 Channel 4 polarity.
* Input          : - TIM1_OCPolarity: specifies the OC4 Polarity
*                    This parmeter can be one of the following values:
*                       - TIM1_OCPolarity_High: Output Compare active high
*                       - TIM1_OCPolarity_Low: Output Compare active low
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_OC4PolarityConfig(u16 TIM1_OCPolarity)
{
  /* Check the parameters */
  assert(IS_TIM1_OC_POLARITY(TIM1_OCPolarity));

  /* Set or Reset the CC4P Bit */
  *(vu32 *) CCER_CC4P_BB = (u16)TIM1_OCPolarity;
}

/*******************************************************************************
* Function Name  : TIM1_CCxCmd
* Description    : Enables or disables the TIM1 Capture Compare Channel x.
* Input          : - TIM1_Channel: specifies the TIM1 Channel
*                    This parmeter can be one of the following values:
*                       - TIM1_Channel1: TIM1 Channel1
*                       - TIM1_Channel2: TIM1 Channel2
*                       - TIM1_Channel3: TIM1 Channel3
*                       - TIM1_Channel4: TIM1 Channel4
*                 - Newstate: specifies the TIM1 Channel CCxE bit new state.
*                   This parameter can be: ENABLE or DISABLE. 
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_CCxCmd(u16 TIM1_Channel, u32 Newstate)
{
  /* Check the parameters */
  assert(IS_TIM1_CHANNEL(TIM1_Channel));
  assert(IS_FUNCTIONAL_STATE(Newstate));

  if(TIM1_Channel == TIM1_Channel_1)
  {
    /* Set or Reset the CC1E Bit */
    *(vu32 *) CCER_CC1E_BB = (u16)Newstate;  
  }
  else if(TIM1_Channel == TIM1_Channel_2)
  {
    /* Set or Reset the CC2E Bit */
    *(vu32 *) CCER_CC2E_BB = (u16)Newstate;
  }
  else if(TIM1_Channel == TIM1_Channel_3)
  {
    /* Set or Reset the CC3E Bit */
    *(vu32 *) CCER_CC3E_BB = (u16)Newstate;
  }
  else
  {
    /* Set or Reset the CC4E Bit */
    *(vu32 *) CCER_CC4E_BB = (u16)Newstate;
  }
}

/*******************************************************************************
* Function Name  : TIM1_CCxNCmd
* Description    : Enables or disables the TIM1 Capture Compare Channel xN.
* Input          : - TIM1_Channel: specifies the TIM1 Channel
*                    This parmeter can be one of the following values:
*                       - TIM1_Channel1: TIM1 Channel1
*                       - TIM1_Channel2: TIM1 Channel2
*                       - TIM1_Channel3: TIM1 Channel3
*                 - Newstate: specifies the TIM1 Channel CCxNE bit new state.
*                   This parameter can be: ENABLE or DISABLE. 
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_CCxNCmd(u16 TIM1_Channel, u32 Newstate)
{
    /* Check the parameters */
    assert(IS_TIM1_COMPLEMENTARY_CHANNEL(TIM1_Channel));
    assert(IS_FUNCTIONAL_STATE(Newstate));

    if(TIM1_Channel == TIM1_Channel_1)
    {
        /* Set or Reset the CC1NE Bit */
        *(vu32 *) CCER_CC1NE_BB = (u16)Newstate;  
    }
    else if(TIM1_Channel == TIM1_Channel_2)
    {
        /* Set or Reset the CC2NE Bit */
        *(vu32 *) CCER_CC2NE_BB = (u16)Newstate;
    }
    else 
    {
        /* Set or Reset the CC3NE Bit */
        *(vu32 *) CCER_CC3NE_BB = (u16)Newstate;
    }
}

