dreamted/TRIO_MR_MD/1. TRIO-M/TRIO_M_appl_src_20141204_V5_5_20151207/lib_stm32/src/stm32f10x_tim1_v0901.c
/*******************************************************************************
* Function Name  : TIM1_SelectOCxM
* Description    : Selects the TIM1 Ouput Compare Mode.
*                  This function disables the selected channel before changing 
*                  the Ouput Compare Mode. User has to enable this channel using
*                  TIM1_CCxCmd and TIM1_CCxNCmd functions.
* Input          : - TIM1_Channel: specifies the TIM1 Channel
*                    This parmeter can be one of the following values:
*                       - TIM1_Channel1: TIM1 Channel1
*                       - TIM1_Channel2: TIM1 Channel2
*                       - TIM1_Channel3: TIM1 Channel3
*                       - TIM1_Channel4: TIM1 Channel4
*                  - TIM1_OCMode: specifies the TIM1 Output Compare Mode.
*                    This paramter can be one of the following values:
*                       - TIM1_OCMode_Timing
*                       - TIM1_OCMode_Active
*                       - TIM1_OCMode_Toggle
*                       - TIM1_OCMode_PWM1
*                       - TIM1_OCMode_PWM2
*                       - TIM1_ForcedAction_Active
*                       - TIM1_ForcedAction_InActive
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_SelectOCxM(u16 TIM1_Channel, u16 TIM1_OCMode)
{
  /* Check the parameters */
  assert(IS_TIM1_CHANNEL(TIM1_Channel));
  assert(IS_TIM1_OCM(TIM1_OCMode));

  if(TIM1_Channel == TIM1_Channel_1)
  {
    /* Disable the Channel 1: Reset the CCE Bit */
    *(vu32 *) CCER_CC1E_BB = CCER_CCE_Reset;

    /* Reset the Output Compare Bits */
    TIM1->CCMR.Data[0] &= OC13Mode_Mask;

    /* Set the Ouput Compare Mode */
    TIM1->CCMR.Data[0] |= TIM1_OCMode;
  }
  else if(TIM1_Channel == TIM1_Channel_2)
  {
    /* Disable the Channel 2: Reset the CCE Bit */
    *(vu32 *) CCER_CC2E_BB = CCER_CCE_Reset;

    /* Reset the Output Compare Bits */
    TIM1->CCMR.Data[0] &= OC24Mode_Mask;

    /* Set the Ouput Compare Mode */
    TIM1->CCMR.Data[0] |= (u16)((u16)TIM1_OCMode << 8);
  }
  else if(TIM1_Channel == TIM1_Channel_3)
  {
    /* Disable the Channel 3: Reset the CCE Bit */
    *(vu32 *) CCER_CC3E_BB = CCER_CCE_Reset;

    /* Reset the Output Compare Bits */
    TIM1->CCMR.Data[1] &= OC13Mode_Mask;

    /* Set the Ouput Compare Mode */
    TIM1->CCMR.Data[1] |= TIM1_OCMode;
  }
  else
  {
    /* Disable the Channel 4: Reset the CCE Bit */
    *(vu32 *) CCER_CC4E_BB = CCER_CCE_Reset;

    /* Reset the Output Compare Bits */
    TIM1->CCMR.Data[1] &= OC24Mode_Mask;

    /* Set the Ouput Compare Mode */
    TIM1->CCMR.Data[1] |= (u16)((u16)TIM1_OCMode << 8);
  }
}

/*******************************************************************************
* Function Name  : TIM1_SetCounter
* Description    : Sets the TIM1 Counter Register value
* Input          : - Counter: specifies the Counter register new value.
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_SetCounter(u16 Counter)
{
  /* Set the Counter Register value */
  TIM1->CNT = Counter;
}

/*******************************************************************************
* Function Name  : TIM1_SetAutoreload
* Description    : Sets the TIM1 Autoreload Register value.
* Input          : - Autoreload: specifies the Autoreload register new value.
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_SetAutoreload(u16 Autoreload)
{
  /* Set the Autoreload Register value */
  TIM1->ARR = Autoreload;
}

/*******************************************************************************
* Function Name  : TIM1_SetCompare1
* Description    : Sets the TIM1 Capture Compare1 Register value.
* Input          : - Compare1: specifies the Capture Compare1 register new value.
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_SetCompare1(u16 Compare1)
{
  /* Set the Capture Compare1 Register value */
  TIM1->CCR1 = Compare1;
}

/*******************************************************************************
* Function Name  : TIM1_SetCompare2
* Description    : Sets the TIM1 Capture Compare2 Register value.
* Input          : - Compare2: specifies the Capture Compare2 register new value.
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_SetCompare2(u16 Compare2)
{
  /* Set the Capture Compare2 Register value */
  TIM1->CCR2 = Compare2;
}

/*******************************************************************************
* Function Name  : TIM1_SetCompare3
* Description    : Sets the TIM1 Capture Compare3 Register value.
* Input          : - Compare3: specifies the Capture Compare3 register new value.
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_SetCompare3(u16 Compare3)
{
  /* Set the Capture Compare3 Register value */
  TIM1->CCR3 = Compare3;
}

/*******************************************************************************
* Function Name  : TIM1_SetCompare4
* Description    : Sets the TIM1 Capture Compare4 Register value.
* Input          : - Compare4: specifies the Capture Compare4 register new value.
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_SetCompare4(u16 Compare4)
{
  /* Set the Capture Compare4 Register value */
  TIM1->CCR4 = Compare4;
}

/*******************************************************************************
* Function Name  : TIM1_SetIC1Prescaler
* Description    : Sets the TIM1 Input Capture 1 prescaler.
* Input          : - TIM1_IC1Prescaler: specifies the Input Capture prescaler
*                    new value.
*                    This parameter can be one of the following values:
*                       - TIM1_ICPSC_DIV1: no prescaler
*                       - TIM1_ICPSC_DIV2: capture is done once every 2 events
*                       - TIM1_ICPSC_DIV4: capture is done once every 4 events
*                       - TIM1_ICPSC_DIV8: capture is done once every 8 events
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_SetIC1Prescaler(u16 TIM1_IC1Prescaler)
{
  u32 tmpccmr1 = 0;
  
  /* Check the parameters */
  assert(IS_TIM1_IC_PRESCALER(TIM1_IC1Prescaler));

  tmpccmr1 = TIM1->CCMR.Data[0];

