dreamted/TRIO_MR_MD/1. TRIO-M/TRIO_M_appl_src_20141204_V5_5_20151207/lib_stm32/src/stm32f10x_tim1_v0901.c
  /* Reset the IC1PSC Bits */
  tmpccmr1 &= CCMR_IC13PSC_Mask;

  /* Set the IC1PSC value */
  tmpccmr1 |= TIM1_IC1Prescaler;

  TIM1->CCMR.Data[0] = (u16)tmpccmr1;
}

/*******************************************************************************
* Function Name  : TIM1_SetIC2Prescaler
* Description    : Sets the TIM1 Input Capture 2 prescaler.
* Input          : - TIM1_IC2Prescaler: specifies the Input Capture prescaler
*                    new value.
*                    This parameter can be one of the following values:
*                       - TIM1_ICPSC_DIV1: no prescaler
*                       - TIM1_ICPSC_DIV2: capture is done once every 2 events
*                       - TIM1_ICPSC_DIV4: capture is done once every 4 events
*                       - TIM1_ICPSC_DIV8: capture is done once every 8 events
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_SetIC2Prescaler(u16 TIM1_IC2Prescaler)
{
  u32 tmpccmr1 = 0;

  /* Check the parameters */
  assert(IS_TIM1_IC_PRESCALER(TIM1_IC2Prescaler));

  tmpccmr1 = TIM1->CCMR.Data[0];

  /* Reset the IC2PSC Bits */
  tmpccmr1 &= CCMR_IC24PSC_Mask;

  /* Set the IC2PSC value */
  tmpccmr1 |= (u16)((u16)TIM1_IC2Prescaler << 8);

  TIM1->CCMR.Data[0] = (u16)tmpccmr1;
}

/*******************************************************************************
* Function Name  : TIM1_SetIC3Prescaler
* Description    : Sets the TIM1 Input Capture 3 prescaler.
* Input          : - TIM1_IC3Prescaler: specifies the Input Capture prescaler
*                    new value.
*                    This parameter can be one of the following values:
*                       - TIM1_ICPSC_DIV1: no prescaler
*                       - TIM1_ICPSC_DIV2: capture is done once every 2 events
*                       - TIM1_ICPSC_DIV4: capture is done once every 4 events
*                       - TIM1_ICPSC_DIV8: capture is done once every 8 events
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_SetIC3Prescaler(u16 TIM1_IC3Prescaler)
{
  u32 tmpccmr2 = 0;

  /* Check the parameters */
  assert(IS_TIM1_IC_PRESCALER(TIM1_IC3Prescaler));

  tmpccmr2 = TIM1->CCMR.Data[1];

  /* Reset the IC3PSC Bits */
  tmpccmr2 &= CCMR_IC13PSC_Mask;

  /* Set the IC3PSC value */
  tmpccmr2 |= TIM1_IC3Prescaler;

  TIM1->CCMR.Data[1] = (u16)tmpccmr2;
}

/*******************************************************************************
* Function Name  : TIM1_SetIC4Prescaler
* Description    : Sets the TIM1 Input Capture 4 prescaler.
* Input          : - TIM1_IC4Prescaler: specifies the Input Capture prescaler
*                    new value.
*                    This parameter can be one of the following values:
*                       - TIM1_ICPSC_DIV1: no prescaler
*                       - TIM1_ICPSC_DIV2: capture is done once every 2 events
*                       - TIM1_ICPSC_DIV4: capture is done once every 4 events
*                       - TIM1_ICPSC_DIV8: capture is done once every 8 events
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_SetIC4Prescaler(u16 TIM1_IC4Prescaler)
{
  u32 tmpccmr2 = 0;

  /* Check the parameters */
  assert(IS_TIM1_IC_PRESCALER(TIM1_IC4Prescaler));

  tmpccmr2 = TIM1->CCMR.Data[1];

  /* Reset the IC4PSC Bits */
  tmpccmr2 &= CCMR_IC24PSC_Mask;

  /* Set the IC4PSC value */
  tmpccmr2 |= (u16)((u16)TIM1_IC4Prescaler << 8);

  TIM1->CCMR.Data[1] = (u16)tmpccmr2;
}

/*******************************************************************************
* Function Name  : TIM1_SetClockDivision
* Description    : Sets the TIM1 Clock Division value.
* Input          : - TIM1_CKD: specifies the clock division value.
*                    This parameter can be one of the following value:
*                       - TIM1_CKD_DIV1: TDTS = Tck_tim
*                       - TIM1_CKD_DIV2: TDTS = 2*Tck_tim
*                       - TIM1_CKD_DIV4: TDTS = 4*Tck_tim
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_SetClockDivision(u16 TIM1_CKD)
{
  u32 tmpcr1 = 0;

  tmpcr1 = TIM1->CR1.Data;

  /* Reset the CKD Bits */
  tmpcr1 &= CR1_CKD_Mask;

  /* Set the CKD value */
  tmpcr1 |= TIM1_CKD;

  TIM1->CR1.Data = (u16)tmpcr1;
}

/*******************************************************************************
* Function Name  : TIM1_GetCapture1
* Description    : Gets the TIM1 Input Capture 1 value.
* Input          : None
* Output         : None
* Return         : Capture Compare 1 Register value.
*******************************************************************************/
u16 TIM1_GetCapture1(void)
{
  /* Get the Capture 1 Register value */
  return TIM1->CCR1;
}

/*******************************************************************************
* Function Name  : TIM1_GetCapture2
* Description    : Gets the TIM1 Input Capture 2 value.
* Input          : None
* Output         : None
* Return         : Capture Compare 2 Register value.
*******************************************************************************/
u16 TIM1_GetCapture2(void)
{
  /* Get the Capture 2 Register value */
  return TIM1->CCR2;
}

/*******************************************************************************
* Function Name  : TIM1_GetCapture3
* Description    : Gets the TIM1 Input Capture 3 value.
* Input          : None
* Output         : None
* Return         : Capture Compare 3 Register value.
*******************************************************************************/
u16 TIM1_GetCapture3(void)
{
  /* Get the Capture 3 Register value */
  return TIM1->CCR3;
}

/*******************************************************************************
* Function Name  : TIM1_GetCapture4
* Description    : Gets the TIM1 Input Capture 4 value.
* Input          : None
* Output         : None
* Return         : Capture Compare 4 Register value.
*******************************************************************************/
u16 TIM1_GetCapture4(void)
{
  /* Get the Capture 4 Register value */
  return TIM1->CCR4;
}

