dreamted/TRIO_MR_MD/1. TRIO-M/TRIO_M_appl_src_20141204_V5_5_20151207/lib_stm32/src/stm32f10x_tim1_v0901.c
/*******************************************************************************
* Function Name  : TI1_Config
* Description    : Configure the TI1 as Input.
* Input          : - TIM1_ICPolarity : The Input Polarity.
*                    This parameter can be one of the following values:
*                       - TIM1_ICPolarity_Rising
*                       - TIM1_ICPolarity_Falling
*                  - TIM1_ICSelection: specifies the input to be used.
*                    This parameter can be one of the following values:
*                       - TIM1_ICSelection_DirectTI: TIM1 Input 1 is selected to
*                         be connected to IC1.
*                       - TIM1_ICSelection_IndirectTI: TIM1 Input 1 is selected to
*                         be connected to IC2.
*                       - TIM1_ICSelection_TRGI:TIM1 Input 1 is selected to be
*                         connected to TRGI.
*                  - TIM1_ICFilter: Specifies the Input Capture Filter.
*                    This parameter must be a value between 0x00 and 0x0F.
* Output         : None
* Return         : None
*******************************************************************************/
static void TI1_Config(u16 TIM1_ICPolarity, u16 TIM1_ICSelection,
                       u8 TIM1_ICFilter)
{
  u32 tmpccmr1 = 0;

  tmpccmr1 = TIM1->CCMR.Data[0];

  /* Disable the Channel 1: Reset the CCE Bit */
  *(vu32 *) CCER_CC1E_BB = CCER_CCE_Reset;

  /* Select the Input and set the filter */
  tmpccmr1 &= CCMR_CC13S_Mask & CCMR_IC13F_Mask;
  tmpccmr1 |= (u16)TIM1_ICSelection | (u16)((u16)TIM1_ICFilter << 4);

  TIM1->CCMR.Data[0] = (u16)tmpccmr1;

  /* Select the Polarity */
  *(vu32 *) CCER_CC1P_BB = TIM1_ICPolarity;

  /* Set the CCE Bit */
  *(vu32 *) CCER_CC1E_BB = CCER_CCE_Set;
}

/*******************************************************************************
* Function Name  : TI2_Config
* Description    : Configure the TI2 as Input.
* Input          : - TIM1_ICPolarity : The Input Polarity.
*                    This parameter can be one of the following values:
*                       - TIM1_ICPolarity_Rising
*                       - TIM1_ICPolarity_Falling
*                  - TIM1_ICSelection: specifies the input to be used.
*                    This parameter can be one of the following values:
*                       - TIM1_ICSelection_DirectTI: TIM1 Input 2 is selected to
*                         be connected to IC2.
*                       - TIM1_ICSelection_IndirectTI: TIM1 Input 2 is selected to
*                         be connected to IC1.
*                       - TIM1_ICSelection_TRGI: TIM1 Input 2 is selected to be
*                         connected to TRGI.
*                  - TIM1_ICFilter: Specifies the Input Capture Filter.
*                    This parameter must be a value between 0x00 and 0x0F.
* Output         : None
* Return         : None
*******************************************************************************/
static void TI2_Config(u16 TIM1_ICPolarity, u16 TIM1_ICSelection,
                       u8 TIM1_ICFilter)
{
  u32 tmpccmr1 = 0;

  tmpccmr1 = TIM1->CCMR.Data[0];

  /* Disable the Channel 2: Reset the CCE Bit */
  *(vu32 *) CCER_CC2E_BB = CCER_CCE_Reset;

  /* Select the Input and set the filter */
  tmpccmr1 &= CCMR_CC24S_Mask & CCMR_IC24F_Mask;
  tmpccmr1 |= (u16)((u16)TIM1_ICSelection << 8) | (u16)((u16)TIM1_ICFilter <<12);

  TIM1->CCMR.Data[0] = (u16)tmpccmr1;

  /* Select the Polarity */
  *(vu32 *) CCER_CC2P_BB = TIM1_ICPolarity;

  /* Set the CCE Bit */
  *(vu32 *) CCER_CC2E_BB = CCER_CCE_Set;

}

/*******************************************************************************
* Function Name  : TI3_Config
* Description    : Configure the TI3 as Input.
* Input          : - TIM1_ICPolarity : The Input Polarity.
*                    This parameter can be one of the following values:
*                       - TIM1_ICPolarity_Rising
*                       - TIM1_ICPolarity_Falling
*                  - TIM1_ICSelection: specifies the input to be used.
*                    This parameter can be one of the following values:
*                       - TIM1_ICSelection_DirectTI: TIM1 Input 3 is selected to
*                         be connected to IC3.
*                       - TIM1_ICSelection_IndirectTI: TIM1 Input 3 is selected to
*                         be connected to IC4.
*                       - TIM1_ICSelection_TRGI: TIM1 Input 3 is selected to be
*                         connected to TRGI.
*                  - TIM1_ICFilter: Specifies the Input Capture Filter.
*                    This parameter must be a value between 0x00 and 0x0F.
* Output         : None
* Return         : None
*******************************************************************************/
static void TI3_Config(u16 TIM1_ICPolarity, u16 TIM1_ICSelection,
                       u8 TIM1_ICFilter)
{
  u32 tmpccmr2 = 0;

  tmpccmr2 = TIM1->CCMR.Data[1];

  /* Disable the Channel 3: Reset the CCE Bit */
  *(vu32 *) CCER_CC3E_BB = CCER_CCE_Reset;

  /* Select the Input and set the filter */
  tmpccmr2 &= CCMR_CC13S_Mask & CCMR_IC13F_Mask;
  tmpccmr2 |= (u16)TIM1_ICSelection | (u16)((u16)TIM1_ICFilter << 4);

  TIM1->CCMR.Data[1] = (u16)tmpccmr2;

  /* Select the Polarity */
  *(vu32 *) CCER_CC3P_BB = TIM1_ICPolarity;

  /* Set the CCE Bit */
  *(vu32 *) CCER_CC3E_BB = CCER_CCE_Set;
}

/*******************************************************************************
* Function Name  : TI4_Config
* Description    : Configure the TI4 as Input.
* Input          : - TIM1_ICPolarity : The Input Polarity.
*                    This parameter can be one of the following values:
*                       - TIM1_ICPolarity_Rising
*                       - TIM1_ICPolarity_Falling
*                  - TIM1_ICSelection: specifies the input to be used.
*                    This parameter can be one of the following values:
*                       - TIM1_ICSelection_DirectTI: TIM1 Input 4 is selected to
*                         be connected to IC4.
*                       - TIM1_ICSelection_IndirectTI: TIM1 Input 4 is selected to
*                         be connected to IC3.
*                       - TIM1_ICSelection_TRGI: TIM1 Input 4 is selected to be
*                         connected to TRGI.
*                  - TIM1_ICFilter: Specifies the Input Capture Filter.
*                    This parameter must be a value between 0x00 and 0x0F.
* Output         : None
* Return         : None
*******************************************************************************/
static void TI4_Config(u16 TIM1_ICPolarity, u16 TIM1_ICSelection,
                       u8 TIM1_ICFilter)
{
    u32 tmpccmr2 = 0;
  
    tmpccmr2 = TIM1->CCMR.Data[1];
    
    /* Disable the Channel 4: Reset the CCE Bit */
    *(vu32 *) CCER_CC4E_BB = CCER_CCE_Reset;
  
    /* Select the Input and set the filter */
    tmpccmr2 &= CCMR_CC24S_Mask & CCMR_IC24F_Mask;
    tmpccmr2 |= (u16)((u16)TIM1_ICSelection << 8) | (u16)((u16)TIM1_ICFilter << 12);
  
    TIM1->CCMR.Data[1] = (u16)tmpccmr2;
  
    /* Select the Polarity */
    *(vu32 *) CCER_CC4P_BB = TIM1_ICPolarity;
  
    /* Set the CCE Bit */
    *(vu32 *) CCER_CC4E_BB = CCER_CCE_Set;
}
/******************* (C) COPYRIGHT 2007 STMicroelectronics *****END OF FILE****/
